{
  "actions": {
    "skipToContent": "Skip to content"
  },
  "navigation": {
    "header": "Overview",
    "about": "About",
    "skills": "Skills",
    "experience": "Experience",
    "education": "Education",
    "projects": "Projects",
    "contacts": "Contacts",
    "footer": "Footer"
  },
  "sidebar": {
    "resume": "Resume",
    "firstName": "Ekaterina",
    "lastName": "Ryazanova",
    "name": "Ekaterina Ryazanova",
    "role": "Frontend Developer",
    "summary": "Frontend developer focused on maintainable UI architecture, performance optimization, and authenticated user flows.",
    "social": {
      "email": "Email",
      "github": "GitHub",
      "linkedin": "LinkedIn",
      "telegram": "Telegram"
    },
    "language": {
      "label": "Language",
      "english": "English",
      "russian": "Russian",
      "switchToEnglish": "Switch language to English",
      "switchToRussian": "Switch language to Russian"
    }
  },
  "sections": {
    "header": {
      "overline": "Last updated in Dec 2025",
      "title": "Overview",
      "summary": "Frontend developer with commercial experience building React and Next.js applications. Focused on maintainable UI architecture, performance optimization, and robust authenticated user flows.",
      "chips": {
        "designSystems": "UI architecture",
        "accessibility": "Performance",
        "productUx": "Auth flows"
      }
    },
    "about": {
      "title": "About",
      "body1": "Frontend developer focused on building clean and well-crafted user interfaces. The main area of interest is UI development — pixel-perfect implementation, attention to visual and interaction details, and structured, maintainable layout.",
      "body2": "In commercial projects, I work with React and Next.js, implementing interfaces from Figma designs. My work includes component structure, accessibility, internationalization, and API interaction logic. The goal is to deliver clear, stable, and user-friendly interfaces.",
      "body3": "I pay close attention to frontend quality and performance, regularly working with Lighthouse metrics, optimizing page loading and resource handling, and carefully implementing loading and error states. Strong attention to detail is a key part of my approach.",
      "body4": "Alongside development, I mentor students in frontend development. Outside of work, I enjoy running and cycling."
    },
    "skills": {
      "title": "Skills",
      "core": "Frontend / Core",
      "coreBody1": "HTML5",
      "coreBody2": "CSS3",
      "coreBody3": "JavaScript (ES6+)",
      "coreBody4": "React",
      "coreBody5": "Next.js",
      "coreBody6": "TypeScript",
      "ui": "UI & Layout",
      "uiBody1": "Pixel-perfect",
      "uiBody2": "Responsiveness",
      "uiBody3": "a11y",
      "uiBody4": "Design systems",
      "uiBody5": "MUI",
      "workflow": "Workflow & Tooling",
      "workflowBody1": "Git",
      "workflowBody2": "npm",
      "workflowBody3": "Figma",
      "workflowBody4": "DevTools",
      "workflowBody5": "Lighthouse",
      "workflowBody6": "SEO basics"
    },
    "experience": {
      "title": "Experience",
      "role1": {
        "title": "Frontend Developer · EXPLYT, VEAI",
        "period": "Apr 2025 – present",
        "summary": "Frontend development for an AI-powered IDE plugin (B2B and B2C), including marketing websites and authenticated user interfaces.\n\nMarketing websites were built with React and Next.js using a multi-page, reusable component-based approach. The scope included responsive layout, internationalization, SEO optimization, and performance improvements with a focus on Lighthouse metrics.\n\nAuthenticated user interfaces were closely integrated with the backend, covering subscription states, user balance, and payment-related flows. The work involved handling loading and error states, as well as complex display logic depending on region, language, currency, and available payment methods. UI structure and interaction logic were designed on the frontend side.\n\nAlso contributed to maintaining plugin documentation using Docusaurus.",
        "chips": {
          "designSystem": "React/Next.js",
          "performance": "Performance",
          "accessibility": "Auth UI"
        }
      },
      "role2": {
        "title": "Frontend Course Mentor · ITMO University",
        "period": "Sept 2025 – present",
        "summary": "Mentored students in frontend development as part of a university course. Reviewed and assessed assignments with a focus on semantic HTML, CSS structure, and JavaScript logic.\n\nContributed to course materials and delivered frontend lectures. Designed a responsive layout assignment with pixel-perfect validation based on Figma screenshots, including automated visual comparison.",
        "chips": {
          "dataViz": "Mentoring",
          "roleBasedUi": "Reviews",
          "designOps": "Visual tests"
        }
      }
    },
    "education": {
      "title": "Education",
      "degree": {
        "title": "ITMO University, BS in Computer Technologies",
        "period": "Sept 2022 – present",
        "summary": "Undergraduate program in computer technologies."
      },
      "courses": {
        "title": "Relevant coursework",
        "period": "",
        "summary": "Web Development · Algorithms and Data Structures · JavaScript · Advanced Frontend Development"
      }
    },
    "projects": {
      "title": "Projects",
      "project1": {
        "title": "React Course Platform",
        "period": "",
        "summary": "Educational web platform for hosting React courses with a hierarchical structure of courses, modules, and lectures. The frontend was built with React, focusing on reusable components and a predictable UI structure. The interface architecture was designed to support multiple levels of nesting and clear navigation between course content. Typed data handling was implemented, with backend behavior emulated to enable independent frontend development. The main focus was on structured UI, clear interface states, and component scalability.",
        "chips": {
          "react": "React",
          "typescript": "Component architecture",
          "rest": "Typed data"
        }
      },
      "project2": {
        "title": "Project Management System",
        "period": "",
        "summary": "Frontend application for managing projects and tasks using board-based workflows. Implemented a status-driven board interface with task creation, editing, and movement between columns. Particular attention was paid to user flows, loading states, and seamless UI updates without full page reloads. The project focused on clean UI implementation, asynchronous data handling, search and filtering, and robust error and edge-case handling.",
        "chips": {
          "uiKit": "Drag and drop",
          "docs": "Async data",
          "accessibility": "Search & filtering"
        }
      }
    },
    "contacts": {
      "title": "Contacts",
      "emailLabel": "Email",
      "phoneLabel": "Phone",
      "githubLabel": "GitHub",
      "telegramLabel": "Telegram",
      "locationLabel": "Location",
      "locationValue": "Saint Petersburg, Russia"
    },
    "footer": {
      "title": "Last updated",
      "body1": "Dec 2025.",
      "body2": "Saint Petersburg, Russia."
    }
  }
}
