{
  "actions": {
    "skipToContent": "Перейти к содержимому"
  },
  "navigation": {
    "header": "Обзор",
    "about": "О себе",
    "skills": "Навыки",
    "experience": "Опыт",
    "education": "Образование",
    "projects": "Проекты",
    "contacts": "Контакты",
    "footer": "Заключение"
  },
  "sidebar": {
    "resume": "Резюме",
    "name": "Екатерина Рязанова",
    "role": "Frontend-разработчик",
    "summary": "Frontend-разработчик с фокусом на поддерживаемой архитектуре UI, производительности и аутентифицированных сценариях.",
    "social": {
      "email": "Почта",
      "github": "GitHub",
      "linkedin": "LinkedIn",
      "telegram": "Телеграм"
    },
    "language": {
      "label": "Язык",
      "english": "Английский",
      "russian": "Русский",
      "switchToEnglish": "Переключить язык на английский",
      "switchToRussian": "Переключить язык на русский"
    }
  },
  "sections": {
    "header": {
      "overline": "Обновлено в декабре 2025",
      "title": "Обзор",
      "summary": "Frontend-разработчик с коммерческим опытом разработки приложений на React и Next.js. Фокус на поддерживаемой архитектуре UI, оптимизации производительности и надежных аутентифицированных пользовательских сценариях.",
      "chips": {
        "designSystems": "Архитектура UI",
        "accessibility": "Производительность",
        "productUx": "Auth-сценарии"
      }
    },
    "about": {
      "title": "О себе",
      "body1": "Фронтенд-разработчик с фокусом на создание аккуратных и продуманных пользовательских интерфейсов. Основной интерес — UI-часть: пиксель-перфект реализация, внимание к визуальным и интерактивным деталям, чистая и структурированная вёрстка.",
      "body2": "В коммерческих проектах работаю с React и Next.js, реализуя интерфейсы по макетам из Figma. В задачи входит проработка структуры компонентов, доступности, интернационализации и логики взаимодействия с API. Приоритет — понятные, устойчивые и удобные интерфейсы, корректно работающие в разных состояниях.",
      "body3": "Отдельное внимание уделяю качеству и производительности фронтенда: анализирую метрики Lighthouse, оптимизирую загрузку страниц и ресурсов, аккуратно прорабатываю состояния загрузки и ошибок. Отличаюсь высокой внимательностью к деталям и мелочам в интерфейсе.",
      "body4": "Параллельно занимаюсь менторством студентов на курсе по фронтенд-разработке. Вне работы увлекаюсь бегом и велоспортом."
    },
    "skills": {
      "title": "Навыки",
      "core": "Frontend / Core",
      "coreBody1": "HTML5",
      "coreBody2": "CSS3",
      "coreBody3": "JavaScript (ES6+)",
      "coreBody4": "React",
      "coreBody5": "Next.js",
      "coreBody6": "TypeScript",
      "ui": "UI & Layout",
      "uiBody1": "Pixel-perfect",
      "uiBody2": "a11y",
      "uiBody3": "Доступность",
      "uiBody4": "Дизайн-системы",
      "uiBody5": "MUI",
      "workflow": "Workflow & Tooling",
      "workflowBody1": "Git",
      "workflowBody2": "npm",
      "workflowBody3": "Figma",
      "workflowBody4": "DevTools",
      "workflowBody5": "Lighthouse",
      "workflowBody6": "SEO basics"
    },
    "experience": {
      "title": "Опыт",
      "role1": {
        "title": "Frontend-разработчик · EXPLYT, VEAI",
        "period": "Апр 2025 — настоящее время",
        "summary": "Разработка фронтенда для AI-плагина для IDE (B2B и B2C), включая маркетинговые сайты и авторизованные пользовательские интерфейсы.\n\nМаркетинговые сайты реализовывались на React и Next.js с многостраничной структурой и переиспользуемыми UI-компонентами. В рамках проектов обеспечивались адаптивная вёрстка, интернационализация, SEO-оптимизация и кроссбраузерная корректность, а также улучшение производительности и показателей Lighthouse.\n\nВ личных кабинетах разрабатывались интерфейсы, интегрированные с бэкендом: отображение статусов подписки, баланса и работа с платёжной логикой. Прорабатывались состояния загрузки, ошибок и сложные сценарии отображения данных в зависимости от региона, языка, валюты и доступных способов оплаты. UI-структура и логика взаимодействия формировались на стороне фронтенда.\n\nУчаствовала в поддержке документации плагина с использованием Docusaurus.",
        "chips": {
          "designSystem": "React/Next.js",
          "performance": "Производительность",
          "accessibility": "Auth UI"
        }
      },
      "role2": {
        "title": "Ментор по фронтенду · Университет ИТМО",
        "period": "Сен 2025 — настоящее время",
        "summary": "Менторство студентов по фронтенд-разработке в рамках университетского курса. Проверка и оценка домашних заданий с фокусом на семантическую вёрстку, организацию CSS и JavaScript-логику.\n\nУчастие в разработке учебных материалов и проведение лекций по фронтенду. Разработка практического задания по адаптивной вёрстке с пиксель-перфект проверкой по скриншотам из Figma (с автоматизированным сравнением).",
        "chips": {
          "dataViz": "Менторство",
          "roleBasedUi": "Ревью",
          "designOps": "Визуальные тесты"
        }
      }
    },
    "education": {
      "title": "Образование",
      "degree": {
        "title": "Университет ИТМО, бакалавриат «Компьютерные технологии»",
        "period": "Сен 2022 — настоящее время",
        "summary": "Бакалавриат по компьютерным технологиям."
      },
      "courses": {
        "title": "Профильные курсы",
        "period": "",
        "summary": "Веб-разработка · Алгоритмы и структуры данных · JavaScript · Продвинутый курс по фронтенд-разработке"
      }
    },
    "projects": {
      "title": "Проекты",
      "project1": {
        "title": "React Course Platform",
        "period": "",
        "summary": "Учебная веб-платформа для размещения курсов по React с иерархией курсов, модулей и лекций.\n\nФронтенд реализован на React с акцентом на переиспользуемые компоненты и предсказуемую структуру интерфейса. Проектировалась архитектура UI для различных уровней вложенности (курсы, модули, лекции), а также навигация между ними.\n\nРабота с данными была типизирована; для независимой разработки фронтенда использовалась эмуляция бэкенда. Основной фокус — структурированный UI, понятные состояния интерфейса и масштабируемость компонентов.",
        "chips": {
          "react": "React",
          "typescript": "Компонентная архитектура",
          "rest": "Типизированные данные"
        }
      },
      "project2": {
        "title": "Project Management System",
        "period": "",
        "summary": "Фронтенд-приложение для управления проектами и задачами с досками и статусами.\n\nРеализован интерфейс с колонками, отражающими статусы задач, а также создание, редактирование и перемещение задач. Особое внимание уделялось пользовательским сценариям, состояниям загрузки и обновлению интерфейса без перезагрузки страницы.\n\nПроект был ориентирован на аккуратную реализацию UI, работу с асинхронными данными, поиск и фильтрацию, а также обработку ошибок и пограничных случаев.",
        "chips": {
          "uiKit": "Drag and drop",
          "docs": "Асинхронные данные",
          "accessibility": "Поиск и фильтры"
        }
      }
    },
    "contacts": {
      "title": "Контакты",
      "emailLabel": "Почта",
      "phoneLabel": "Телефон",
      "githubLabel": "GitHub",
      "telegramLabel": "Телеграм",
      "locationLabel": "Местоположение",
      "locationValue": "Санкт-Петербург, Россия"
    },
    "footer": {
      "title": "Последнее обновление",
      "body1": "Декабрь 2025.",
      "body2": "Санкт-Петербург, Россия."
    }
  }
}
